tiborsimon/embedded-tdd-headers/pic/pic18/pic18f2682_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F2682_H_
#define _PIC18F2682_H_

#define RXF6SIDH                      0
#define RXF6SIDH_SID3                 1
#define RXF6SID3                      2
#define RXF6SIDH_SID4                 3
#define RXF6SID4                      4
#define RXF6SIDH_SID5                 5
#define RXF6SID5                      6
#define RXF6SIDH_SID6                 7
#define RXF6SID6                      8
#define RXF6SIDH_SID7                 9
#define RXF6SID7                      10
#define RXF6SIDH_SID8                 11
#define RXF6SID8                      12
#define RXF6SIDH_SID9                 13
#define RXF6SID9                      14
#define RXF6SID10                     15
#define RXF6SIDH_SID10                16
#define RXF6SIDL                      17
#define RXF6EID16                     18
#define RXF6SIDL_EID16                19
#define RXF6SIDL_EID17                20
#define RXF6EID17                     21
#define RXF6SIDL_EXIDE                22
#define RXF6EXIDEN                    23
#define RXF6SIDL_EXIDEN               24
#define RXF6SIDL_SID0                 25
#define RXF6SID0                      26
#define RXF6SIDL_SID1                 27
#define RXF6SID1                      28
#define RXF6SID2                      29
#define RXF6SIDL_SID2                 30
#define RXF6EIDH                      31
#define RXF6EIDH_EID8                 32
#define RXF6EID8                      33
#define RXF6EIDH_EID9                 34
#define RXF6EID9                      35
#define RXF6EID10                     36
#define RXF6EIDH_EID10                37
#define RXF6EIDH_EID11                38
#define RXF6EID11                     39
#define RXF6EIDH_EID12                40
#define RXF6EID12                     41
#define RXF6EIDH_EID13                42
#define RXF6EID13                     43
#define RXF6EIDH_EID14                44
#define RXF6EID14                     45
#define RXF6EID15                     46
#define RXF6EIDH_EID15                47
#define RXF6EIDL                      48
#define RXF6EIDL_EID0                 49
#define RXF6EID0                      50
#define RXF6EIDL_EID1                 51
#define RXF6EID1                      52
#define RXF6EIDL_EID2                 53
#define RXF6EID2                      54
#define RXF6EIDL_EID3                 55
#define RXF6EID3                      56
#define RXF6EIDL_EID4                 57
#define RXF6EID4                      58
#define RXF6EIDL_EID5                 59
#define RXF6EID5                      60
#define RXF6EIDL_EID6                 61
#define RXF6EID6                      62
#define RXF6EIDL_EID7                 63
#define RXF6EID7                      64
#define RXF7SIDH                      65
#define RXF7SIDH_SID3                 66
#define RXF7SID3                      67
#define RXF7SIDH_SID4                 68
#define RXF7SID4                      69
#define RXF7SIDH_SID5                 70
#define RXF7SID5                      71
#define RXF7SIDH_SID6                 72
#define RXF7SID6                      73
#define RXF7SIDH_SID7                 74
#define RXF7SID7                      75
#define RXF7SIDH_SID8                 76
#define RXF7SID8                      77
#define RXF7SIDH_SID9                 78
#define RXF7SID9                      79
#define RXF7SIDH_SID10                80
#define RXF7SID10                     81
#define RXF7SIDL                      82
#define RXF7EID16                     83
#define RXF7SIDL_EID16                84
#define RXF7EID17                     85
#define RXF7SIDL_EID17                86
#define RXF7SIDL_EXIDEN               87
#define RXF7EXIDEN                    88
#define RXF7SIDL_EXIDE                89
#define RXF7SID0                      90
#define RXF7SIDL_SID0                 91
#define RXF7SID1                      92
#define RXF7SIDL_SID1                 93
#define RXF7SIDL_SID2                 94
#define RXF7SID2                      95
#define RXF7EIDH                      96
#define RXF7EID8                      97
#define RXF7EIDH_EID8                 98
#define RXF7EID9                      99
#define RXF7EIDH_EID9                 100
#define RXF7EID10                     101
#define RXF7EIDH_EID10                102
#define RXF7EID11                     103
#define RXF7EIDH_EID11                104
#define RXF7EID12                     105
#define RXF7EIDH_EID12                106
#define RXF7EID13                     107
#define RXF7EIDH_EID13                108
#define RXF7EID14                     109
#define RXF7EIDH_EID14                110
#define RXF7EID15                     111
#define RXF7EIDH_EID15                112
#define RXF7EIDL                      113
#define RXF7EIDL_EID0                 114
#define RXF7EID0                      115
#define RXF7EIDL_EID1                 116
#define RXF7EID1                      117
#define RXF7EIDL_EID2                 118
#define RXF7EID2                      119
#define RXF7EIDL_EID3                 120
#define RXF7EID3                      121
#define RXF7EIDL_EID4                 122
#define RXF7EID4                      123
#define RXF7EIDL_EID5                 124
#define RXF7EID5                      125
#define RXF7EIDL_EID6                 126
#define RXF7EID6                      127
#define RXF7EIDL_EID7                 128
#define RXF7EID7                      129
#define RXF8SIDH                      130
#define RXF8SID3                      131
#define RXF8SIDH_SID3                 132
#define RXF8SID4                      133
#define RXF8SIDH_SID4                 134
#define RXF8SID5                      135
#define RXF8SIDH_SID5                 136
#define RXF8SID6                      137
#define RXF8SIDH_SID6                 138
#define RXF8SID7                      139
#define RXF8SIDH_SID7                 140
#define RXF8SID8                      141
#define RXF8SIDH_SID8                 142
#define RXF8SID9                      143
#define RXF8SIDH_SID9                 144
#define RXF8SID10                     145
#define RXF8SIDH_SID10                146
#define RXF8SIDL                      147
#define RXF8SIDL_EID16                148
#define RXF8EID16                     149
#define RXF8SIDL_EID17                150
#define RXF8EID17                     151
#define RXF8SIDL_EXIDEN               152
#define RXF8EXIDEN                    153
#define RXF8SIDL_EXIDE                154
#define RXF8SID0                      155
#define RXF8SIDL_SID0                 156
#define RXF8SID1                      157
#define RXF8SIDL_SID1                 158
#define RXF8SIDL_SID2                 159
#define RXF8SID2                      160
#define RXF8EIDH                      161
#define RXF8EID8                      162
#define RXF8EIDH_EID8                 163
#define RXF8EID9                      164
#define RXF8EIDH_EID9                 165
#define RXF8EID10                     166
#define RXF8EIDH_EID10                167
#define RXF8EID11                     168
#define RXF8EIDH_EID11                169
#define RXF8EID12                     170
#define RXF8EIDH_EID12                171
#define RXF8EID13                     172
#define RXF8EIDH_EID13                173
#define RXF8EID14                     174
#define RXF8EIDH_EID14                175
#define RXF8EID15                     176
#define RXF8EIDH_EID15                177
#define RXF8EIDL                      178
#define RXF8EIDL_EID0                 179
#define RXF8EID0                      180
#define RXF8EIDL_EID1                 181
#define RXF8EID1                      182
#define RXF8EIDL_EID2                 183
#define RXF8EID2                      184
#define RXF8EIDL_EID3                 185
#define RXF8EID3                      186
#define RXF8EIDL_EID4                 187
#define RXF8EID4                      188
#define RXF8EIDL_EID5                 189
#define RXF8EID5                      190
#define RXF8EIDL_EID6                 191
#define RXF8EID6                      192
#define RXF8EIDL_EID7                 193
#define RXF8EID7                      194
#define RXF9SIDH                      195
#define RXF9SID3                      196
#define RXF9SIDH_SID3                 197
#define RXF9SID4                      198
#define RXF9SIDH_SID4                 199
#define RXF9SID5                      200
#define RXF9SIDH_SID5                 201
#define RXF9SID6                      202
#define RXF9SIDH_SID6                 203
#define RXF9SID7                      204
#define RXF9SIDH_SID7                 205
#define RXF9SID8                      206
#define RXF9SIDH_SID8                 207
#define RXF9SID9                      208
#define RXF9SIDH_SID9                 209
#define RXF9SID10                     210
#define RXF9SIDH_SID10                211
#define RXF9SIDL                      212
#define RXF9SIDL_EID16                213
#define RXF9EID16                     214
#define RXF9SIDL_EID17                215
#define RXF9EID17                     216
#define RXF9EXIDEN                    217
#define RXF9SIDL_EXIDE                218
#define RXF9SIDL_EXIDEN               219
#define RXF9SIDL_SID0                 220
#define RXF9SID0                      221
#define RXF9SIDL_SID1                 222
#define RXF9SID1                      223
#define RXF9SIDL_SID2                 224
#define RXF9SID2                      225
#define RXF9EIDH                      226
#define RXF9EID8                      227
#define RXF9EIDH_EID8                 228
#define RXF9EID9                      229
#define RXF9EIDH_EID9                 230
#define RXF9EIDH_EID10                231
#define RXF9EID10                     232
#define RXF9EIDH_EID11                233
#define RXF9EID11                     234
#define RXF9EIDH_EID12                235
#define RXF9EID12                     236
#define RXF9EIDH_EID13                237
#define RXF9EID13                     238
#define RXF9EIDH_EID14                239
#define RXF9EID14                     240
#define RXF9EIDH_EID15                241
#define RXF9EID15                     242
#define RXF9EIDL                      243
#define RXF9EID0                      244
#define RXF9EIDL_EID0                 245
#define RXF9EID1                      246
#define RXF9EIDL_EID1                 247
#define RXF9EID2                      248
#define RXF9EIDL_EID2                 249
#define RXF9EID3                      250
#define RXF9EIDL_EID3                 251
#define RXF9EID4                      252
#define RXF9EIDL_EID4                 253
#define RXF9EID5                      254
#define RXF9EIDL_EID5                 255
#define RXF9EID6                      256
#define RXF9EIDL_EID6                 257
#define RXF9EID7                      258
#define RXF9EIDL_EID7                 259
#define RXF10SIDH                     260
#define RXF10SIDH_SID3                261
#define RXF10SID3                     262
#define RXF10SIDH_SID4                263
#define RXF10SID4                     264
#define RXF10SIDH_SID5                265
#define RXF10SID5                     266
#define RXF10SIDH_SID6                267
#define RXF10SID6                     268
#define RXF10SIDH_SID7                269
#define RXF10SID7                     270
#define RXF10SIDH_SID8                271
#define RXF10SID8                     272
#define RXF10SIDH_SID9                273
#define RXF10SID9                     274
#define RXF10SID10                    275
#define RXF10SIDH_SID10               276
#define RXF10SIDL                     277
#define RXF10EID16                    278
#define RXF10SIDL_EID16               279
#define RXF10EID17                    280
#define RXF10SIDL_EID17               281
#define RXF10SIDL_EXIDEN              282
#define RXF10EXIDEN                   283
#define RXF10SIDL_EXIDE               284
#define RXF10SID0                     285
#define RXF10SIDL_SID0                286
#define RXF10SIDL_SID1                287
#define RXF10SID1                     288
#define RXF10SID2                     289
#define RXF10SIDL_SID2                290
#define RXF10EIDH                     291
#define RXF10EID8                     292
#define RXF10EIDH_EID8                293
#define RXF10EID9                     294
#define RXF10EIDH_EID9                295
#define RXF10EID10                    296
#define RXF10EIDH_EID10               297
#define RXF10EID11                    298
#define RXF10EIDH_EID11               299
#define RXF10EID12                    300
#define RXF10EIDH_EID12               301
#define RXF10EID13                    302
#define RXF10EIDH_EID13               303
#define RXF10EID14                    304
#define RXF10EIDH_EID14               305
#define RXF10EID15                    306
#define RXF10EIDH_EID15               307
#define RXF10EIDL                     308
#define RXF10EID0                     309
#define RXF10EIDL_EID0                310
#define RXF10EID1                     311
#define RXF10EIDL_EID1                312
#define RXF10EID2                     313
#define RXF10EIDL_EID2                314
#define RXF10EID3                     315
#define RXF10EIDL_EID3                316
#define RXF10EID4                     317
#define RXF10EIDL_EID4                318
#define RXF10EID5                     319
#define RXF10EIDL_EID5                320
#define RXF10EID6                     321
#define RXF10EIDL_EID6                322
#define RXF10EID7                     323
#define RXF10EIDL_EID7                324
#define RXF11SIDH                     325
#define RXF11SID3                     326
#define RXF11SIDH_SID3                327
#define RXF11SID4                     328
#define RXF11SIDH_SID4                329
#define RXF11SID5                     330
#define RXF11SIDH_SID5                331
#define RXF11SID6                     332
#define RXF11SIDH_SID6                333
#define RXF11SID7                     334
#define RXF11SIDH_SID7                335
#define RXF11SID8                     336
#define RXF11SIDH_SID8                337
#define RXF11SID9                     338
#define RXF11SIDH_SID9                339
#define RXF11SIDH_SID10               340
#define RXF11SID10                    341
#define RXF11SIDL                     342
#define RXF11EID16                    343
#define RXF11SIDL_EID16               344
#define RXF11EID17                    345
#define RXF11SIDL_EID17               346
#define RXF11EXIDEN                   347
#define RXF11SIDL_EXIDEN              348
#define RXF11SIDL_EXIDE               349
#define RXF11SIDL_SID0                350
#define RXF11SID0                     351
#define RXF11SIDL_SID1                352
#define RXF11SID1                     353
#define RXF11SID2                     354
#define RXF11SIDL_SID2                355
#define RXF11EIDH                     356
#define RXF11EID8                     357
#define RXF11EIDH_EID8                358
#define RXF11EIDH_EID9                359
#define RXF11EID9                     360
#define RXF11EID10                    361
#define RXF11EIDH_EID10               362
#define RXF11EID11                    363
#define RXF11EIDH_EID11               364
#define RXF11EID12                    365
#define RXF11EIDH_EID12               366
#define RXF11EID13                    367
#define RXF11EIDH_EID13               368
#define RXF11EID14                    369
#define RXF11EIDH_EID14               370
#define RXF11EID15                    371
#define RXF11EIDH_EID15               372
#define RXF11EIDL                     373
#define RXF11EID0                     374
#define RXF11EIDL_EID0                375
#define RXF11EID1                     376
#define RXF11EIDL_EID1                377
#define RXF11EID2                     378
#define RXF11EIDL_EID2                379
#define RXF11EID3                     380
#define RXF11EIDL_EID3                381
#define RXF11EID4                     382
#define RXF11EIDL_EID4                383
#define RXF11EID5                     384
#define RXF11EIDL_EID5                385
#define RXF11EID6                     386
#define RXF11EIDL_EID6                387
#define RXF11EID7                     388
#define RXF11EIDL_EID7                389
#define RXF12SIDH                     390
#define RXF12SID3                     391
#define RXF12SIDH_SID3                392
#define RXF12SID4                     393
#define RXF12SIDH_SID4                394
#define RXF12SID5                     395
#define RXF12SIDH_SID5                396
#define RXF12SID6                     397
#define RXF12SIDH_SID6                398
#define RXF12SID7                     399
#define RXF12SIDH_SID7                400
#define RXF12SID8                     401
#define RXF12SIDH_SID8                402
#define RXF12SID9                     403
#define RXF12SIDH_SID9                404
#define RXF12SIDH_SID10               405
#define RXF12SID10                    406
#define RXF12SIDL                     407
#define RXF12EID16                    408
#define RXF12SIDL_EID16               409
#define RXF12EID17                    410
#define RXF12SIDL_EID17               411
#define RXF12SIDL_EXIDEN              412
#define RXF12SIDL_EXIDE               413
#define RXF12EXIDEN                   414
#define RXF12SID0                     415
#define RXF12SIDL_SID0                416
#define RXF12SID1                     417
#define RXF12SIDL_SID1                418
#define RXF12SIDL_SID2                419
#define RXF12SID2                     420
#define RXF12EIDH                     421
#define RXF12EID8                     422
#define RXF12EIDH_EID8                423
#define RXF12EID9                     424
#define RXF12EIDH_EID9                425
#define RXF12EID10                    426
#define RXF12EIDH_EID10               427
#define RXF12EID11                    428
#define RXF12EIDH_EID11               429
#define RXF12EID12                    430
#define RXF12EIDH_EID12               431
#define RXF12EID13                    432
#define RXF12EIDH_EID13               433
#define RXF12EID14                    434
#define RXF12EIDH_EID14               435
#define RXF12EID15                    436
#define RXF12EIDH_EID15               437
#define RXF12EIDL                     438
#define RXF12EIDL_EID0                439
#define RXF12EID0                     440
#define RXF12EIDL_EID1                441
#define RXF12EID1                     442
#define RXF12EIDL_EID2                443
#define RXF12EID2                     444
#define RXF12EIDL_EID3                445
#define RXF12EID3                     446
#define RXF12EIDL_EID4                447
#define RXF12EID4                     448
#define RXF12EIDL_EID5                449
#define RXF12EID5                     450
#define RXF12EIDL_EID6                451
#define RXF12EID6                     452
#define RXF12EIDL_EID7                453
#define RXF12EID7                     454
#define RXF13SIDH                     455
#define RXF13SID3                     456
#define RXF13SIDH_SID3                457
#define RXF13SID4                     458
#define RXF13SIDH_SID4                459
#define RXF13SID5                     460
#define RXF13SIDH_SID5                461
#define RXF13SID6                     462
#define RXF13SIDH_SID6                463
#define RXF13SID7                     464
#define RXF13SIDH_SID7                465
#define RXF13SID8                     466
#define RXF13SIDH_SID8                467
#define RXF13SID9                     468
#define RXF13SIDH_SID9                469
#define RXF13SIDH_SID10               470
#define RXF13SID10                    471
#define RXF13SIDL                     472
#define RXF13EID16                    473
#define RXF13SIDL_EID16               474
#define RXF13SIDL_EID17               475
#define RXF13EID17                    476
#define RXF13SIDL_EXIDE               477
#define RXF13EXIDEN                   478
#define RXF13SIDL_EXIDEN              479
#define RXF13SIDL_SID0                480
#define RXF13SID0                     481
#define RXF13SIDL_SID1                482
#define RXF13SID1                     483
#define RXF13SIDL_SID2                484
#define RXF13SID2                     485
#define RXF13EIDH                     486
#define RXF13EIDH_EID8                487
#define RXF13EID8                     488
#define RXF13EIDH_EID9                489
#define RXF13EID9                     490
#define RXF13EIDH_EID10               491
#define RXF13EID10                    492
#define RXF13EIDH_EID11               493
#define RXF13EID11                    494
#define RXF13EID12                    495
#define RXF13EIDH_EID12               496
#define RXF13EID13                    497
#define RXF13EIDH_EID13               498
#define RXF13EID14                    499
#define RXF13EIDH_EID14               500
#define RXF13EID15                    501
#define RXF13EIDH_EID15               502
#define RXF13EIDL                     503
#define RXF13EID0                     504
#define RXF13EIDL_EID0                505
#define RXF13EID1                     506
#define RXF13EIDL_EID1                507
#define RXF13EID2                     508
#define RXF13EIDL_EID2                509
#define RXF13EID3                     510
#define RXF13EIDL_EID3                511
#define RXF13EID4                     512
#define RXF13EIDL_EID4                513
#define RXF13EID5                     514
#define RXF13EIDL_EID5                515
#define RXF13EID6                     516
#define RXF13EIDL_EID6                517
#define RXF13EID7                     518
#define RXF13EIDL_EID7                519
#define RXF14SIDH                     520
#define RXF14SID3                     521
